{
    "darkvision": {
        "description":
            "You can see in dim light within 60 feet as if it were bright light, and in darkness as if it were dim."
    },
    "dwarven-resilience": {
        "description":
            "You have advantage on saving throws against poison, and resistance against poison damage."
    },
    "dwarven-combat-training": {
        "description": 
            "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
        "proficiencies": [
            "warhammer",
            "handaxe",
            "light-hammer",
            "warhammer"
        ]
    },
    "dwarven-tool-proficiency": {
        "description":
            "You gain proficiency with one of: smiths tools, brewers supplies, or masons tools.",
        "proficiency-choices": {
            "count": 2,
            "choices": [
                "smiths-tools",
                "brewers-supplies",
                "masons-tools"
            ]
        }
    },
    "stonecunning": {
        "description":
            "When making an intelligence (History) check related to stonework, you are proficient and add double your proficiency bonus."
    },
    "dwarven-toughness": {
        "description":
            "Your hit point maximum increases by 1, and again by 1 every time you gain a level."
    },
    "dwarven-armor-training": {
        "description":
            "You have proficiency with light and medium armor.",
        "proficiencies": [
            "light-armor",
            "medium-armor"
        ]
    },
    "keen-senses": {
        "description":
            "You have proficiency in the perception skill.",
        "proficiencies": [
            "perception"
        ]
    },
    "fey-ancestry": {
        "description":
            "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
    },
    "trance": {
        "description":
            "You can meditate for four hours to gain the rest a human gains for 8 hours of sleep."
    },
    "elf-weapon-training": {
        "description":
            "You gain proficiency with the longsword, shortsword, shortbow, and longbow.",
        "proficiencies": [
            "longsword",
            "shortsword",
            "longbow",
            "shortbow"
        ]
    },
    "elf-cantrip": {
        "description":
            "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting stat for it."
    },
    "extra-language": {
        "description":
            "You can speak, read, and write one extra language of your choice."
    },
    "mask-of-the-wild": {
        "description":
            "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
    },
    "superior-darkvision": {
        "description":
            "You can see in dim light within 120 feet as if it were bright light, and in darkness as if it were dim."
    },
    "sunlight-sensitivity": {
        "description":
            "You have disadvantage on attack rolls and ability checks that rely on sight when you, your target, or what you are trying to perceive is in direct sunlight"
    },
    "drow-magic": {
        "description":
            "You know the dancing lights cantrip. When you reach 3rd level, you can cast the faerie fire spell once per day. When you reach 5th level, you can cast darkness once per day. Charisma is your spellcasting ability for these spells."
    },
    "drow-weapon-training": {
        "description":
            "You have proficiency with rapiers, shortswords, and hand crossbows",
        "proficiencies": [
            "rapier",
            "shortsword",
            "hand-crossbow"
        ]
    },
    "lucky": {
        "description":
            "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
    },
    "brave": {
        "description":
            "You have advantage on saving throws against being frightened."
    },
    "halfling-nimbleness": {
        "description":
            "You can move through the space of any creature that is a size larger than yours."
    },
    "naturally-stealthy": {
        "description":
            "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you"
    },
    "stout-resilience": {
        "description":
            "You have advantage on saving throws against poison, and resistance against poison damage."
    },
    "variant-human": {
        "description":
            "You gain proficiency in one skill of your choice, and gain one feat of your choice."
    },
    "draconic-ancestry": {
        "description":
            "You have draconic ancestry. Your breath weapon and damage resistance are based on your chosen dragon type."
    },
    "draconic-breath-weapon": {
        "fullname": "Breath Weapon",
        "description":
            "Your ancestry determines the shape and damage type. Targets must make a saving throw (based on your ancestry) with DC 8 + your constitution modifier + your prof. bonus, and takes 2d6 damage, or half as much on a successful save. Damage increases to 3d6 at 6th level, 4d6 at 11th, and 5d6 at 16th. Recharges after a short or long rest."
    },
    "draconic-damage-resistance": {
        "fullname": "Damage Resistance",
        "description":
            "You have resistance to the damage type associated with your draconic ancestry."
    },
    "gnome-cunning": {
        "description":
            "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
    },
    "natural-illusionist": {
        "description":
            "You know the minor illusion cantrip. Intelligence is your spellcasting ability for it."
    },
    "speak-with-small-beasts": {
        "description":
            "Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animaIs and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets."
    },
    "artificiers-lore": {
        "description":
            "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of the bonus you would normally apply."
    },
    "tinker": {
        "description":
            "You have proficiency with artisan's tools, and with them can spend 1 hour and 10 gp worth of materials to construct a tiny clockwork device.",
        "proficiencies": [
            "artisans-tools"
        ]
    },
    "skill-versatility": {
        "description":
            "You gain proficiency in two skills of your choice."
    },
    "menacing": {
        "description":
            "You gain proficiency in the intimidation skill.",
        "proficiencies": [
            "intimidation"
        ]
    },
    "relentless-endurance": {
        "description":
            "When you are reduced to 0 hit points but not killed outright, you can drop to 1 point instead. You can't use this feature again until you finish a long rest."
    },
    "savage-attacks": {
        "description":
            "You gain proficiency in two skills of your choice."
    },
    "hellish-resistance": {
        "description":
            "You have resistance to fire damage."
    },
    "infernal-legacy": {
        "description":
            "You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spclls" 
    } 
}